Revit 2027 API
BuiltInFailures.GenericMEPFailures.CapsWereAddedWarning Property
 X caps were added.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CapsWereAddedWarning { get; }
Public Shared ReadOnly Property CapsWereAddedWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CapsWereAddedWarning {
	FailureDefinitionId^ get ();
}
static member CapsWereAddedWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GenericMEPFailures Class
Autodesk.Revit.DB Namespace